## API 
### eg alpha vantage

In [1]:
from alpha_vantage.timeseries import TimeSeries

In [2]:
API_key="H456ZLCOCHH7CH10"

In [3]:
ts=TimeSeries(key=API_key,output_format='pandas')

In [4]:
data=ts.get_daily('AAPL')

In [5]:
data

(            1. open  2. high    3. low  4. close    5. volume
 date
 2023-10-23  170.910  174.010  169.9300    173.00   55980109.0
 2023-10-20  175.310  175.420  172.6400    172.88   64244028.0
 2023-10-19  176.040  177.840  175.1900    175.46   59302863.0
 2023-10-18  175.580  177.575  175.1100    175.84   54764375.0
 2023-10-17  176.645  178.420  174.8000    177.15   57549350.0
 ...             ...      ...       ...       ...          ...
 2023-06-07  178.440  181.210  177.3200    177.82   61944615.0
 2023-06-06  179.965  180.120  177.4300    179.21   64848374.0
 2023-06-05  182.630  184.951  178.0350    179.58  121946497.0
 2023-06-02  181.030  181.780  179.2600    180.95   61996913.0
 2023-06-01  177.700  180.120  176.9306    180.09   68901809.0

 [100 rows x 5 columns],
 {'1. Information': 'Daily Prices (open, high, low, close) and Volumes',
  '2. Symbol': 'AAPL',
  '3. Last Refreshed': '2023-10-23',
  '4. Output Size': 'Compact',
  '5. Time Zone': 'US/Eastern'})

In [6]:
data[0]

            1. open  2. high    3. low  4. close    5. volume
date
2023-10-23  170.910  174.010  169.9300    173.00   55980109.0
2023-10-20  175.310  175.420  172.6400    172.88   64244028.0
2023-10-19  176.040  177.840  175.1900    175.46   59302863.0
2023-10-18  175.580  177.575  175.1100    175.84   54764375.0
2023-10-17  176.645  178.420  174.8000    177.15   57549350.0
...             ...      ...       ...       ...          ...
2023-06-07  178.440  181.210  177.3200    177.82   61944615.0
2023-06-06  179.965  180.120  177.4300    179.21   64848374.0
2023-06-05  182.630  184.951  178.0350    179.58  121946497.0
2023-06-02  181.030  181.780  179.2600    180.95   61996913.0
2023-06-01  177.700  180.120  176.9306    180.09   68901809.0

[100 rows x 5 columns]

In [7]:
data2=data[0]

In [8]:
data2.columns

Index(['1. open', '2. high', '3. low', '4. close', '5. volume'], dtype='object')

In [9]:
data2["4. close"].to_frame()

            4. close
date
2023-10-23    173.00
2023-10-20    172.88
2023-10-19    175.46
2023-10-18    175.84
2023-10-17    177.15
...              ...
2023-06-07    177.82
2023-06-06    179.21
2023-06-05    179.58
2023-06-02    180.95
2023-06-01    180.09

[100 rows x 1 columns]